## ex11 - Gérer des valeurs NULL

Les exemples de données dans les tables de demo.db3 présentés précédemment sont tous exacts et complets. 

Chaque ligne a une valeur pour chaque attribut. 

Cependant, les données réelles ne sont généralement pas aussi propres et ordonnées. Vous trouverez souvent des valeurs NULL dans certaines tables.

Les valeurs nulles dans une base de données peuvent causer quelques maux de tête. De plus, les descriptions dans les normes SQL sur la façon de gérer les NULL semblent ambiguës. 

Il n'apparaît pas clairement dans les documents de normes comment les NULL doivent être traités dans toutes les [circonstances] (https://www.sqlite.org/nulls.html).

Parfois, nous pouvons en fait éviter les NULL en définissant la contrainte NOT NULL lorsque nous créons une table. 

Cependant, il convient de garder à l'esprit que rendre les champs NOT NULL ne fonctionne pas toujours et pourrait créer plus de maux de tête qu'il ne guérit. Toutes les valeurs nulles ne signifient pas qu'il y a un problème avec les données.

SQLite NULL est le terme utilisé pour représenter une valeur manquante. 

Une valeur NULL dans une table est une valeur dans un champ qui semble vide. Cependant, une valeur NULL ne doit pas simplement être considérée comme 0 (zéro) ou une chaîne vide comme «». Il s'agit d'une valeur de vide ou non définie.

Ce notebook présentera:
- Comment faite un **DROP** sur une table **IF EXISTS**
- Comment faire un **CREATE** d'une nouvelle table à partir d'une table existante
- Comment faire un ***UPDATE*** d'une table avec une condition WHERE
- Comment faire un ***COUNT NULL*** avec ***IS NULL***
- Comment donner des valeurs par défaut à ***NULL*** avec la fonction SQLite *** COALESCE ***

In [ ]:
%load_ext sql

In [ ]:
from google.colab import drive
# drive.mount('/content/gdrive')
drive.mount("/content/gdrive", force_remount=True)

Mounted at /content/gdrive

### 1. Connection à la database demo.db3

Il a été précisé que demo.db3 est un extrait d'une modélisation hydrologique. Par conséquent, les données de chaque table sont ordonnées et complètes sans valeurs NULL. Cependant, nous pouvons créer une table avec des valeurs NULL pour la démonstration.

In [ ]:
%sql sqlite:////content/gdrive/MyDrive/Partage/Notebooks_Serie_1/demo.db3

'Connected: @/content/gdrive/MyDrive/Partage/Notebooks_Serie_1/demo.db3'

Si vous ne vous souvenez pas des tables présentes dans la database de démonstration, vous pouvez toujours utiliser la commande suivante pour les retrouver.

In [ ]:
%sql SELECT name FROM sqlite_master WHERE type='table'

 * sqlite:///data/demo.db3
Done.

[(u'rch',),
 (u'hru',),
 (u'sub',),
 (u'sed',),
 (u'watershed_daily',),
 (u'watershed_monthly',),
 (u'watershed_yearly',),
 (u'channel_dimension',),
 (u'hru_info',),
 (u'sub_info',),
 (u'rch_info',),
 (u'ave_plant',),
 (u'ave_annual_hru',),
 (u'ave_monthly_basin',),
 (u'ave_annual_basin',),
 (u'sqlite_sequence',),
 (u'watershed_yearly_bk',)]

### 2. Create a table with NULL values from an existing table

Take the table of watershed_yearly as an example.
- ***Firstly, make a backup table***

>The SQLite CREATE TABLE AS statement is used to create a table from an existing table by copying the existing table's columns.

In [ ]:
%%sql sqlite://
DROP TABLE  IF EXISTS watershed_yearly_bk;
CREATE TABLE watershed_yearly_bk AS SELECT * FROM watershed_yearly

Done.
Done.

[]

Have a quick check of the backup table

In [ ]:
%%sql sqlite://
SELECT YR, PREC_mm 
FROM watershed_yearly_bk
---LIMIT 3

Done.

[(1981, 895.6051025390625),
 (1982, 884.670654296875),
 (1983, 816.6605224609375),
 (1984, 867.5743408203125),
 (1985, 637.7255249023438),
 (1986, 733.8412475585938),
 (1987, 1007.8944702148438),
 (1988, 895.8466186523438),
 (1989, 930.10546875),
 (1990, 751.4553833007812),
 (1991, 984.4703369140625),
 (1992, 907.9463500976562),
 (1993, 1057.7733154296875),
 (1994, 802.126220703125),
 (1995, 696.852783203125),
 (1996, 799.9674682617188),
 (1997, 689.3775024414062),
 (1998, 843.460205078125),
 (1999, 644.3016357421875),
 (2000, 497.9516296386719),
 (2001, 512.2509155273438),
 (2002, 702.0293579101562),
 (2003, 729.9442138671875),
 (2004, 818.3781127929688),
 (2005, 855.0092163085938),
 (2006, 612.2903442382812),
 (2007, 822.1746826171875),
 (2008, 740.0899658203125),
 (2009, 1040.9012451171875),
 (2010, 905.66845703125)]

- ***Secondly, make some values as NULLs***

>SQLite UPDATE Query is used to modify the existing records in a table. You can use WHERE clause with UPDATE query to update selected rows, otherwise all the rows would be updated.

In [ ]:
%%sql sqlite://
UPDATE watershed_yearly_bk
SET PREC_mm = NULL
WHERE
    PREC_mm < 850.0

18 rows affected.

[]

### 3. Find NULLs

Null values cannot be determined with an =. We need to use the IS NULL or IS NOT NULL statements to identify null values. So, to get all records with no recorded snow_depth, we could run this query.

In [ ]:
%%sql sqlite://
SELECT  YR, PREC_mm
FROM watershed_yearly_bk
WHERE PREC_mm IS NULL

Done.

[(1983, None),
 (1985, None),
 (1986, None),
 (1990, None),
 (1994, None),
 (1995, None),
 (1996, None),
 (1997, None),
 (1998, None),
 (1999, None),
 (2000, None),
 (2001, None),
 (2002, None),
 (2003, None),
 (2004, None),
 (2006, None),
 (2007, None),
 (2008, None)]

The count of years with NULLs

In [ ]:
%%sql sqlite://
SELECT  COUNT(YR) AS MISSING
FROM watershed_yearly_bk
WHERE PREC_mm IS NULL

Done.

[(18,)]

:) It is right the number of rows we updated.

### 4. Handle NULLs

NULLs can be ambiguous and annoying as ther are identified differently depending on data sources. Tale can have NULL values for a number of reasons such as observations that were not recorded and data corruption.

In general, there are two main strategies to handle NULLs during the query session and ***NOT*** to change original data in the table.

#### 4.1  Do not use rows with NULL values

This strategy is quite simple as we always can filter the data with a ***WHERE IS NOT NULL*** condition. However, in practice, the data would be used at all, if the ratio of NULLs is too high.

In [ ]:
%%sql sqlite://
SELECT  YR, PREC_mm
FROM watershed_yearly_bk
WHERE PREC_mm IS NOT NULL

Done.

[(1981, 895.6051025390625),
 (1982, 884.670654296875),
 (1984, 867.5743408203125),
 (1987, 1007.8944702148438),
 (1988, 895.8466186523438),
 (1989, 930.10546875),
 (1991, 984.4703369140625),
 (1992, 907.9463500976562),
 (1993, 1057.7733154296875),
 (2005, 855.0092163085938),
 (2009, 1040.9012451171875),
 (2010, 905.66845703125)]

*Calculate the counts of NULLs, NOT_NULLs and total*. Keep in mind that the ***COUNT*** function will neglet NULL values.

In [ ]:
%%sql sqlite://
SELECT SUM(CASE WHEN PREC_mm IS NULL THEN 1 else 0 END) COUNT_NULLs,
       COUNT(PREC_mm) COUNT_NOT_NULLs,
       COUNT(YR) AS TOTAL
From watershed_yearly_bk

Done.

[(18, 12, 30)]

#### 4.2 Replace NULL values with sensible values***

It is recommended that you should firstly check the database document to make sure that nullable columns (columns that are allowed to have null values) have documented what a null value means from a business perspective before replacing NULL values with sensible values.

The SQLite provides a more elegant way of handling NULL values. Tha is to use the COALESCE() function that accepts two or more arguments and returns the first non-null argument into a specified default value if it is null. If all the arguments are NULL, the COALESCE function returns NULL.

The following illustrates the syntax of the COALESCE function:<br>
*** COALESCE(parameter1, parameter2, …)***;<br>

Here we want all NULLs of PREC_mm to be treated as the climatological mean of NOT NULLs.

***Calculate the mean nof NON-NULLs***

In [ ]:
%%sql sqlite://
SELECT avg(PREC_mm)
From watershed_yearly_bk

Done.

[(936.1221313476562,)]

***Replace NULLs with the above mean of NON-NULLs***

In [ ]:
%%sql sqlite://
SELECT YR, COALESCE(PREC_mm, 936.122131348) as Precipitation
From watershed_yearly_bk

Done.

[(1981, 895.6051025390625),
 (1982, 884.670654296875),
 (1983, 936.122131348),
 (1984, 867.5743408203125),
 (1985, 936.122131348),
 (1986, 936.122131348),
 (1987, 1007.8944702148438),
 (1988, 895.8466186523438),
 (1989, 930.10546875),
 (1990, 936.122131348),
 (1991, 984.4703369140625),
 (1992, 907.9463500976562),
 (1993, 1057.7733154296875),
 (1994, 936.122131348),
 (1995, 936.122131348),
 (1996, 936.122131348),
 (1997, 936.122131348),
 (1998, 936.122131348),
 (1999, 936.122131348),
 (2000, 936.122131348),
 (2001, 936.122131348),
 (2002, 936.122131348),
 (2003, 936.122131348),
 (2004, 936.122131348),
 (2005, 855.0092163085938),
 (2006, 936.122131348),
 (2007, 936.122131348),
 (2008, 936.122131348),
 (2009, 1040.9012451171875),
 (2010, 905.66845703125)]

### Summary

Dealing with NULL values is a complicated task. It would be better to get assistances from domain experts or you know very clearly what the NULL vlaues were presented for.